InformationRegisters/НастройкиВремениРеакцииПоЛидам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВремениРеакцииПоЛидам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяВЧасах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатусЛида</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЛида</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиВремениРеакцииПоЛидам/Ext/ManagerModule.bsl
//++ №12763
Функция ПолучитьНастройкуВремениРеакцииПоЛидам() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЛида.Ссылка КАК СтатусЛида,
	|	ЕСТЬNULL(НастройкиВремениРеакцииПоЛидам.ВремяВЧасах, 0) КАК ВремяВЧасах
	|ИЗ
	|	Справочник.СтатусыЛида КАК СтатусыЛида
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВремениРеакцииПоЛидам КАК НастройкиВремениРеакцииПоЛидам
	|		ПО СтатусыЛида.Ссылка = НастройкиВремениРеакцииПоЛидам.СтатусЛида
	|
	|ГДЕ
	|	НЕ СтатусыЛида.ПометкаУдаления
	|	И НЕ СтатусыЛида.Наименование ПОДОБНО ""%(не используется)%""
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыЛида.РеквизитДопУпорядочивания
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СохранитьНастройкуВремениРеакцииПоЛидам(НастройкиВремениРеакцииПоЛидам) Экспорт
	
	// Очищаем настройки в регистре, т.к. туда фиксируем только данные со значениями
	НаборЗаписей = РегистрыСведений.НастройкиВремениРеакцииПоЛидам.СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();
	
	Для Каждого ТекущаяСтрока Из НастройкиВремениРеакцииПоЛидам Цикл
		
		Если НЕ ТекущаяСтрока.ВремяВЧасах = 0 Тогда
			
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
//-- №12763
